spec/fixtures/invoice/cancel/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://svcs.sandbox.paypal.com/Invoice/CreateInvoice
    body: 
      encoding: UTF-8
      string: "{\"invoice\":{\"merchantEmail\":\"chardy_1345003248_per@gmail.com\",\"payerEmail\":\"chardy_1345003165_per@gmail.com\",\"itemList\":{\"item\":[{\"name\":\"iPhone 5\",\"quantity\":1,\"unitPrice\":1000.0}]},\"currencyCode\":\"USD\",\"paymentTerms\":\"Net30\"},\"requestEnvelope\":{\"errorLanguage\":\"en_US\",\"detailLevel\":\"ReturnAll\"}}"
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1.0
      X-Paypal-Security-Userid: 
      - chardy_api1.gmail.com
      X-Paypal-Security-Password: 
      - "8DTSWBZC7GDR3T4X"
      X-Paypal-Security-Signature: 
      - AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS
      X-Paypal-Request-Data-Format: 
      - JSON
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Paypal-Application-Id: 
      - APP-80W284485P519543T
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Sun, 27 Jan 2013 16:14:07 GMT
      Server: 
      - Apache-Coyote/1.1
      Cache-Control: 
      - no-cache
      X-Paypal-Message-Protocol: 
      - NONE
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Ebay-Soa-Request-Id: 
      - 13c7cc98-2b50-a486-d637-6877fffffe96!Invoice!10.72.109.99![]
      X-Paypal-Operation-Name: 
      - CreateInvoice
      X-Paypal-Service-Name: 
      - "{http://svcs.paypal.com/types/pt}Invoice"
      X-Paypal-Service-Version: 
      - 1.0.0
      Content-Type: 
      - application/json;charset=UTF-8
      Set-Cookie: 
      - Apache=10.72.109.11.1359303246510625; path=/; expires=Tue, 20-Jan-43 16:14:06 GMT
      Vary: 
      - Accept-Encoding
      Transfer-Encoding: 
      - chunked
    body: 
      encoding: ASCII-8BIT
      string: "{\"responseEnvelope\":{\"timestamp\":\"2013-01-27T08:14:07.660-08:00\",\"ack\":\"Success\",\"correlationId\":\"c46fef04983dc\",\"build\":\"4120519\"},\"invoiceID\":\"INV2-VRD8-BV7B-GTXL-DJEQ\",\"invoiceNumber\":\"0058\",\"invoiceURL\":\"https:\\/\\/www.sandbox.paypal.com\\/us\\/cgi-bin\\/?cmd=_inv-details&id=INV2-VRD8-BV7B-GTXL-DJEQ\",\"totalAmount\":\"100000\"}"
    http_version: 
  recorded_at: Sun, 27 Jan 2013 16:14:07 GMT
- request: 
    method: post
    uri: https://svcs.sandbox.paypal.com/Invoice/CreateAndSendInvoice
    body: 
      encoding: UTF-8
      string: "{\"invoice\":{\"merchantEmail\":\"chardy_1345003248_per@gmail.com\",\"payerEmail\":\"chardy_1345003165_per@gmail.com\",\"itemList\":{\"item\":[{\"name\":\"iPhone 5\",\"quantity\":1,\"unitPrice\":1000.0}]},\"currencyCode\":\"USD\",\"paymentTerms\":\"Net30\"},\"requestEnvelope\":{\"errorLanguage\":\"en_US\",\"detailLevel\":\"ReturnAll\"}}"
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1.0
      X-Paypal-Security-Userid: 
      - chardy_api1.gmail.com
      X-Paypal-Security-Password: 
      - "8DTSWBZC7GDR3T4X"
      X-Paypal-Security-Signature: 
      - AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS
      X-Paypal-Request-Data-Format: 
      - JSON
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Paypal-Application-Id: 
      - APP-80W284485P519543T
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Sun, 27 Jan 2013 16:14:51 GMT
      Server: 
      - Apache-Coyote/1.1
      Cache-Control: 
      - no-cache
      X-Paypal-Message-Protocol: 
      - NONE
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Ebay-Soa-Request-Id: 
      - 13c7cca2-d0b0-a486-d637-6877fffffe92!Invoice!10.72.109.99![]
      X-Paypal-Operation-Name: 
      - CreateAndSendInvoice
      X-Paypal-Service-Name: 
      - "{http://svcs.paypal.com/types/pt}Invoice"
      X-Paypal-Service-Version: 
      - 1.0.0
      Content-Type: 
      - application/json;charset=UTF-8
      Set-Cookie: 
      - Apache=10.72.109.11.1359303290116256; path=/; expires=Tue, 20-Jan-43 16:14:50 GMT
      Vary: 
      - Accept-Encoding
      Transfer-Encoding: 
      - chunked
    body: 
      encoding: ASCII-8BIT
      string: "{\"responseEnvelope\":{\"timestamp\":\"2013-01-27T08:14:51.687-08:00\",\"ack\":\"Success\",\"correlationId\":\"ed0e0f3aa2c66\",\"build\":\"4120519\"},\"invoiceID\":\"INV2-QFJV-MBTN-49PF-5KGY\",\"invoiceNumber\":\"0060\",\"invoiceURL\":\"https:\\/\\/www.sandbox.paypal.com\\/us\\/cgi-bin\\/?cmd=_inv-details&id=INV2-QFJV-MBTN-49PF-5KGY\",\"totalAmount\":\"100000\"}"
    http_version: 
  recorded_at: Sun, 27 Jan 2013 16:14:52 GMT
- request: 
    method: post
    uri: https://svcs.sandbox.paypal.com/Invoice/CancelInvoice
    body: 
      encoding: UTF-8
      string: "{\"invoiceID\":\"INV2-QFJV-MBTN-49PF-5KGY\",\"requestEnvelope\":{\"errorLanguage\":\"en_US\",\"detailLevel\":\"ReturnAll\"}}"
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1.0
      X-Paypal-Security-Userid: 
      - chardy_api1.gmail.com
      X-Paypal-Security-Password: 
      - "8DTSWBZC7GDR3T4X"
      X-Paypal-Security-Signature: 
      - AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS
      X-Paypal-Request-Data-Format: 
      - JSON
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Paypal-Application-Id: 
      - APP-80W284485P519543T
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Sun, 27 Jan 2013 16:14:54 GMT
      Server: 
      - Apache-Coyote/1.1
      Cache-Control: 
      - no-cache
      X-Paypal-Message-Protocol: 
      - NONE
      X-Paypal-Response-Data-Format: 
      - JSON
      X-Ebay-Soa-Request-Id: 
      - 13c7cca3-a3d0-a486-d637-6877fffffe91!Invoice!10.72.109.99![]
      X-Paypal-Operation-Name: 
      - CancelInvoice
      X-Paypal-Service-Name: 
      - "{http://svcs.paypal.com/types/pt}Invoice"
      X-Paypal-Service-Version: 
      - 1.0.0
      Content-Type: 
      - application/json;charset=UTF-8
      Set-Cookie: 
      - Apache=10.72.109.11.1359303293494489; path=/; expires=Tue, 20-Jan-43 16:14:53 GMT
      Vary: 
      - Accept-Encoding
      Transfer-Encoding: 
      - chunked
    body: 
      encoding: ASCII-8BIT
      string: "{\"responseEnvelope\":{\"timestamp\":\"2013-01-27T08:14:53.999-08:00\",\"ack\":\"Success\",\"correlationId\":\"5e4a06d2a3b53\",\"build\":\"4120519\"},\"invoiceID\":\"INV2-QFJV-MBTN-49PF-5KGY\",\"invoiceNumber\":\"0060\",\"invoiceURL\":\"https:\\/\\/www.sandbox.paypal.com\\/us\\/cgi-bin\\/?cmd=_inv-details&id=INV2-QFJV-MBTN-49PF-5KGY\"}"
    http_version: 
  recorded_at: Sun, 27 Jan 2013 16:14:54 GMT
recorded_with: VCR 2.3.0
